pabigot/msp430-elf/include/msp430fr59881.h
#define ESICAAZ             (0x0020)      /* Comparator Offset calibration annulation */

#define ESIREPEAT_0         (0x0000)      /* These bits configure the duration of this state */
#define ESIREPEAT_1         (0x0800)      /* ESIREPEATx selects the number of clock cycles for this state. The number of clock cycles = ESIREPEATx + 1 */
#define ESIREPEAT_2         (0x1000)
#define ESIREPEAT_3         (0x1800)
#define ESIREPEAT_4         (0x2000)
#define ESIREPEAT_5         (0x2800)
#define ESIREPEAT_6         (0x3000)
#define ESIREPEAT_7         (0x3800)
#define ESIREPEAT_8         (0x4000)
#define ESIREPEAT_9         (0x4800)
#define ESIREPEAT_10        (0x5000)
#define ESIREPEAT_11        (0x5800)
#define ESIREPEAT_12        (0x6000)
#define ESIREPEAT_13        (0x6800)
#define ESIREPEAT_14        (0x7000)
#define ESIREPEAT_15        (0x7800)
#define ESIREPEAT_16        (0x8000)
#define ESIREPEAT_17        (0x8800)
#define ESIREPEAT_18        (0x9000)
#define ESIREPEAT_19        (0x9800)
#define ESIREPEAT_20        (0xA000)
#define ESIREPEAT_21        (0xA800)
#define ESIREPEAT_22        (0xB000)
#define ESIREPEAT_23        (0xB800)
#define ESIREPEAT_24        (0xC000)
#define ESIREPEAT_25        (0xC800)
#define ESIREPEAT_26        (0xD000)
#define ESIREPEAT_27        (0xD800)
#define ESIREPEAT_28        (0xE000)
#define ESIREPEAT_29        (0xE800)
#define ESIREPEAT_30        (0xF000)
#define ESIREPEAT_31        (0xF800)
#define ESICH_0             (0x0000)      /* Input channel select: ESICH0 */
#define ESICH_1             (0x0001)      /* Input channel select: ESICH1 */
#define ESICH_2             (0x0002)      /* Input channel select: ESICH2 */
#define ESICH_3             (0x0003)      /* Input channel select: ESICH3 */
/************************************************************
* EXTENDED SCAN INTERFACE RAM
************************************************************/
#define __MSP430_HAS_ESI_RAM__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_ESI_RAM__ 0x0E00
#define ESI_RAM_BASE __MSP430_BASEADDRESS_ESI_RAM__

#define ESIRAM0_              0x0E00      /* ESI RAM 0 */
sfrb(ESIRAM0, ESIRAM0_);
#define ESIRAM1_              0x0E01      /* ESI RAM 1 */
sfrb(ESIRAM1, ESIRAM1_);
#define ESIRAM2_              0x0E02      /* ESI RAM 2 */
sfrb(ESIRAM2, ESIRAM2_);
#define ESIRAM3_              0x0E03      /* ESI RAM 3 */
sfrb(ESIRAM3, ESIRAM3_);
#define ESIRAM4_              0x0E04      /* ESI RAM 4 */
sfrb(ESIRAM4, ESIRAM4_);
#define ESIRAM5_              0x0E05      /* ESI RAM 5 */
sfrb(ESIRAM5, ESIRAM5_);
#define ESIRAM6_              0x0E06      /* ESI RAM 6 */
sfrb(ESIRAM6, ESIRAM6_);
#define ESIRAM7_              0x0E07      /* ESI RAM 7 */
sfrb(ESIRAM7, ESIRAM7_);
#define ESIRAM8_              0x0E08      /* ESI RAM 8 */
sfrb(ESIRAM8, ESIRAM8_);
#define ESIRAM9_              0x0E09      /* ESI RAM 9 */
sfrb(ESIRAM9, ESIRAM9_);
#define ESIRAM10_             0x0E0A      /* ESI RAM 10 */
sfrb(ESIRAM10, ESIRAM10_);
#define ESIRAM11_             0x0E0B      /* ESI RAM 11 */
sfrb(ESIRAM11, ESIRAM11_);
#define ESIRAM12_             0x0E0C      /* ESI RAM 12 */
sfrb(ESIRAM12, ESIRAM12_);
#define ESIRAM13_             0x0E0D      /* ESI RAM 13 */
sfrb(ESIRAM13, ESIRAM13_);
#define ESIRAM14_             0x0E0E      /* ESI RAM 14 */
sfrb(ESIRAM14, ESIRAM14_);
#define ESIRAM15_             0x0E0F      /* ESI RAM 15 */
sfrb(ESIRAM15, ESIRAM15_);
#define ESIRAM16_             0x0E10      /* ESI RAM 16 */
sfrb(ESIRAM16, ESIRAM16_);
#define ESIRAM17_             0x0E11      /* ESI RAM 17 */
sfrb(ESIRAM17, ESIRAM17_);
#define ESIRAM18_             0x0E12      /* ESI RAM 18 */
sfrb(ESIRAM18, ESIRAM18_);
#define ESIRAM19_             0x0E13      /* ESI RAM 19 */
sfrb(ESIRAM19, ESIRAM19_);
#define ESIRAM20_             0x0E14      /* ESI RAM 20 */
sfrb(ESIRAM20, ESIRAM20_);
#define ESIRAM21_             0x0E15      /* ESI RAM 21 */
sfrb(ESIRAM21, ESIRAM21_);
#define ESIRAM22_             0x0E16      /* ESI RAM 22 */
sfrb(ESIRAM22, ESIRAM22_);
#define ESIRAM23_             0x0E17      /* ESI RAM 23 */
sfrb(ESIRAM23, ESIRAM23_);
#define ESIRAM24_             0x0E18      /* ESI RAM 24 */
sfrb(ESIRAM24, ESIRAM24_);
#define ESIRAM25_             0x0E19      /* ESI RAM 25 */
sfrb(ESIRAM25, ESIRAM25_);
#define ESIRAM26_             0x0E1A      /* ESI RAM 26 */
sfrb(ESIRAM26, ESIRAM26_);
#define ESIRAM27_             0x0E1B      /* ESI RAM 27 */
sfrb(ESIRAM27, ESIRAM27_);
#define ESIRAM28_             0x0E1C      /* ESI RAM 28 */
sfrb(ESIRAM28, ESIRAM28_);
#define ESIRAM29_             0x0E1D      /* ESI RAM 29 */
sfrb(ESIRAM29, ESIRAM29_);
#define ESIRAM30_             0x0E1E      /* ESI RAM 30 */
sfrb(ESIRAM30, ESIRAM30_);
#define ESIRAM31_             0x0E1F      /* ESI RAM 31 */
sfrb(ESIRAM31, ESIRAM31_);
#define ESIRAM32_             0x0E20      /* ESI RAM 32 */
sfrb(ESIRAM32, ESIRAM32_);
#define ESIRAM33_             0x0E21      /* ESI RAM 33 */
sfrb(ESIRAM33, ESIRAM33_);
#define ESIRAM34_             0x0E22      /* ESI RAM 34 */
sfrb(ESIRAM34, ESIRAM34_);
#define ESIRAM35_             0x0E23      /* ESI RAM 35 */
sfrb(ESIRAM35, ESIRAM35_);
#define ESIRAM36_             0x0E24      /* ESI RAM 36 */
sfrb(ESIRAM36, ESIRAM36_);
#define ESIRAM37_             0x0E25      /* ESI RAM 37 */
sfrb(ESIRAM37, ESIRAM37_);
#define ESIRAM38_             0x0E26      /* ESI RAM 38 */
sfrb(ESIRAM38, ESIRAM38_);
#define ESIRAM39_             0x0E27      /* ESI RAM 39 */
sfrb(ESIRAM39, ESIRAM39_);
#define ESIRAM40_             0x0E28      /* ESI RAM 40 */
sfrb(ESIRAM40, ESIRAM40_);
#define ESIRAM41_             0x0E29      /* ESI RAM 41 */
sfrb(ESIRAM41, ESIRAM41_);
#define ESIRAM42_             0x0E2A      /* ESI RAM 42 */
sfrb(ESIRAM42, ESIRAM42_);
#define ESIRAM43_             0x0E2B      /* ESI RAM 43 */
sfrb(ESIRAM43, ESIRAM43_);
#define ESIRAM44_             0x0E2C      /* ESI RAM 44 */
sfrb(ESIRAM44, ESIRAM44_);
#define ESIRAM45_             0x0E2D      /* ESI RAM 45 */
sfrb(ESIRAM45, ESIRAM45_);
#define ESIRAM46_             0x0E2E      /* ESI RAM 46 */
sfrb(ESIRAM46, ESIRAM46_);
#define ESIRAM47_             0x0E2F      /* ESI RAM 47 */
sfrb(ESIRAM47, ESIRAM47_);
#define ESIRAM48_             0x0E30      /* ESI RAM 48 */
sfrb(ESIRAM48, ESIRAM48_);
#define ESIRAM49_             0x0E31      /* ESI RAM 49 */
sfrb(ESIRAM49, ESIRAM49_);
#define ESIRAM50_             0x0E32      /* ESI RAM 50 */
sfrb(ESIRAM50, ESIRAM50_);
#define ESIRAM51_             0x0E33      /* ESI RAM 51 */
sfrb(ESIRAM51, ESIRAM51_);
#define ESIRAM52_             0x0E34      /* ESI RAM 52 */
sfrb(ESIRAM52, ESIRAM52_);
#define ESIRAM53_             0x0E35      /* ESI RAM 53 */
sfrb(ESIRAM53, ESIRAM53_);
#define ESIRAM54_             0x0E36      /* ESI RAM 54 */
sfrb(ESIRAM54, ESIRAM54_);
#define ESIRAM55_             0x0E37      /* ESI RAM 55 */
sfrb(ESIRAM55, ESIRAM55_);
#define ESIRAM56_             0x0E38      /* ESI RAM 56 */
sfrb(ESIRAM56, ESIRAM56_);
#define ESIRAM57_             0x0E39      /* ESI RAM 57 */
sfrb(ESIRAM57, ESIRAM57_);
#define ESIRAM58_             0x0E3A      /* ESI RAM 58 */
sfrb(ESIRAM58, ESIRAM58_);
#define ESIRAM59_             0x0E3B      /* ESI RAM 59 */
sfrb(ESIRAM59, ESIRAM59_);
#define ESIRAM60_             0x0E3C      /* ESI RAM 60 */
sfrb(ESIRAM60, ESIRAM60_);
#define ESIRAM61_             0x0E3D      /* ESI RAM 61 */
sfrb(ESIRAM61, ESIRAM61_);
#define ESIRAM62_             0x0E3E      /* ESI RAM 62 */
sfrb(ESIRAM62, ESIRAM62_);
#define ESIRAM63_             0x0E3F      /* ESI RAM 63 */
sfrb(ESIRAM63, ESIRAM63_);
#define ESIRAM64_             0x0E40      /* ESI RAM 64 */
sfrb(ESIRAM64, ESIRAM64_);
#define ESIRAM65_             0x0E41      /* ESI RAM 65 */
sfrb(ESIRAM65, ESIRAM65_);
#define ESIRAM66_             0x0E42      /* ESI RAM 66 */
sfrb(ESIRAM66, ESIRAM66_);
#define ESIRAM67_             0x0E43      /* ESI RAM 67 */
sfrb(ESIRAM67, ESIRAM67_);
#define ESIRAM68_             0x0E44      /* ESI RAM 68 */
sfrb(ESIRAM68, ESIRAM68_);
#define ESIRAM69_             0x0E45      /* ESI RAM 69 */
sfrb(ESIRAM69, ESIRAM69_);
#define ESIRAM70_             0x0E46      /* ESI RAM 70 */
sfrb(ESIRAM70, ESIRAM70_);
#define ESIRAM71_             0x0E47      /* ESI RAM 71 */
sfrb(ESIRAM71, ESIRAM71_);
#define ESIRAM72_             0x0E48      /* ESI RAM 72 */
sfrb(ESIRAM72, ESIRAM72_);
#define ESIRAM73_             0x0E49      /* ESI RAM 73 */
sfrb(ESIRAM73, ESIRAM73_);
#define ESIRAM74_             0x0E4A      /* ESI RAM 74 */
sfrb(ESIRAM74, ESIRAM74_);
#define ESIRAM75_             0x0E4B      /* ESI RAM 75 */
sfrb(ESIRAM75, ESIRAM75_);
#define ESIRAM76_             0x0E4C      /* ESI RAM 76 */
sfrb(ESIRAM76, ESIRAM76_);
#define ESIRAM77_             0x0E4D      /* ESI RAM 77 */
sfrb(ESIRAM77, ESIRAM77_);
#define ESIRAM78_             0x0E4E      /* ESI RAM 78 */
sfrb(ESIRAM78, ESIRAM78_);
#define ESIRAM79_             0x0E4F      /* ESI RAM 79 */
sfrb(ESIRAM79, ESIRAM79_);
#define ESIRAM80_             0x0E50      /* ESI RAM 80 */
sfrb(ESIRAM80, ESIRAM80_);
#define ESIRAM81_             0x0E51      /* ESI RAM 81 */
sfrb(ESIRAM81, ESIRAM81_);
#define ESIRAM82_             0x0E52      /* ESI RAM 82 */
sfrb(ESIRAM82, ESIRAM82_);
#define ESIRAM83_             0x0E53      /* ESI RAM 83 */
sfrb(ESIRAM83, ESIRAM83_);
#define ESIRAM84_             0x0E54      /* ESI RAM 84 */
sfrb(ESIRAM84, ESIRAM84_);
#define ESIRAM85_             0x0E55      /* ESI RAM 85 */
sfrb(ESIRAM85, ESIRAM85_);
#define ESIRAM86_             0x0E56      /* ESI RAM 86 */
sfrb(ESIRAM86, ESIRAM86_);
#define ESIRAM87_             0x0E57      /* ESI RAM 87 */
sfrb(ESIRAM87, ESIRAM87_);
#define ESIRAM88_             0x0E58      /* ESI RAM 88 */
sfrb(ESIRAM88, ESIRAM88_);
#define ESIRAM89_             0x0E59      /* ESI RAM 89 */
sfrb(ESIRAM89, ESIRAM89_);
#define ESIRAM90_             0x0E5A      /* ESI RAM 90 */
sfrb(ESIRAM90, ESIRAM90_);
#define ESIRAM91_             0x0E5B      /* ESI RAM 91 */
sfrb(ESIRAM91, ESIRAM91_);
#define ESIRAM92_             0x0E5C      /* ESI RAM 92 */
sfrb(ESIRAM92, ESIRAM92_);
#define ESIRAM93_             0x0E5D      /* ESI RAM 93 */
sfrb(ESIRAM93, ESIRAM93_);
#define ESIRAM94_             0x0E5E      /* ESI RAM 94 */
sfrb(ESIRAM94, ESIRAM94_);
#define ESIRAM95_             0x0E5F      /* ESI RAM 95 */
sfrb(ESIRAM95, ESIRAM95_);
#define ESIRAM96_             0x0E60      /* ESI RAM 96 */
sfrb(ESIRAM96, ESIRAM96_);
#define ESIRAM97_             0x0E61      /* ESI RAM 97 */
sfrb(ESIRAM97, ESIRAM97_);
#define ESIRAM98_             0x0E62      /* ESI RAM 98 */
sfrb(ESIRAM98, ESIRAM98_);
#define ESIRAM99_             0x0E63      /* ESI RAM 99 */
sfrb(ESIRAM99, ESIRAM99_);
#define ESIRAM100_            0x0E64      /* ESI RAM 100 */
sfrb(ESIRAM100, ESIRAM100_);
#define ESIRAM101_            0x0E65      /* ESI RAM 101 */
sfrb(ESIRAM101, ESIRAM101_);
#define ESIRAM102_            0x0E66      /* ESI RAM 102 */
sfrb(ESIRAM102, ESIRAM102_);
#define ESIRAM103_            0x0E67      /* ESI RAM 103 */
sfrb(ESIRAM103, ESIRAM103_);
#define ESIRAM104_            0x0E68      /* ESI RAM 104 */
sfrb(ESIRAM104, ESIRAM104_);
#define ESIRAM105_            0x0E69      /* ESI RAM 105 */
sfrb(ESIRAM105, ESIRAM105_);
#define ESIRAM106_            0x0E6A      /* ESI RAM 106 */
sfrb(ESIRAM106, ESIRAM106_);
#define ESIRAM107_            0x0E6B      /* ESI RAM 107 */
sfrb(ESIRAM107, ESIRAM107_);
#define ESIRAM108_            0x0E6C      /* ESI RAM 108 */
sfrb(ESIRAM108, ESIRAM108_);
#define ESIRAM109_            0x0E6D      /* ESI RAM 109 */
sfrb(ESIRAM109, ESIRAM109_);
#define ESIRAM110_            0x0E6E      /* ESI RAM 110 */
sfrb(ESIRAM110, ESIRAM110_);
#define ESIRAM111_            0x0E6F      /* ESI RAM 111 */
sfrb(ESIRAM111, ESIRAM111_);
#define ESIRAM112_            0x0E70      /* ESI RAM 112 */
sfrb(ESIRAM112, ESIRAM112_);
#define ESIRAM113_            0x0E71      /* ESI RAM 113 */
sfrb(ESIRAM113, ESIRAM113_);
#define ESIRAM114_            0x0E72      /* ESI RAM 114 */
sfrb(ESIRAM114, ESIRAM114_);
#define ESIRAM115_            0x0E73      /* ESI RAM 115 */
sfrb(ESIRAM115, ESIRAM115_);
#define ESIRAM116_            0x0E74      /* ESI RAM 116 */
sfrb(ESIRAM116, ESIRAM116_);
#define ESIRAM117_            0x0E75      /* ESI RAM 117 */
sfrb(ESIRAM117, ESIRAM117_);
#define ESIRAM118_            0x0E76      /* ESI RAM 118 */
sfrb(ESIRAM118, ESIRAM118_);
#define ESIRAM119_            0x0E77      /* ESI RAM 119 */
sfrb(ESIRAM119, ESIRAM119_);
#define ESIRAM120_            0x0E78      /* ESI RAM 120 */
sfrb(ESIRAM120, ESIRAM120_);
#define ESIRAM121_            0x0E79      /* ESI RAM 121 */
sfrb(ESIRAM121, ESIRAM121_);
#define ESIRAM122_            0x0E7A      /* ESI RAM 122 */
sfrb(ESIRAM122, ESIRAM122_);
#define ESIRAM123_            0x0E7B      /* ESI RAM 123 */
sfrb(ESIRAM123, ESIRAM123_);
#define ESIRAM124_            0x0E7C      /* ESI RAM 124 */
sfrb(ESIRAM124, ESIRAM124_);
#define ESIRAM125_            0x0E7D      /* ESI RAM 125 */
sfrb(ESIRAM125, ESIRAM125_);
#define ESIRAM126_            0x0E7E      /* ESI RAM 126 */
sfrb(ESIRAM126, ESIRAM126_);
#define ESIRAM127_            0x0E7F      /* ESI RAM 127 */
sfrb(ESIRAM127, ESIRAM127_);
/*************************************************************
* FRAM Memory
*************************************************************/
#define __MSP430_HAS_FRAM__           /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_FRAM__ 0x0140
#define FRAM_BASE __MSP430_BASEADDRESS_FRAM__
#define __MSP430_HAS_GC__            /* Definition to show that Module is available */

#define FRCTL0_               0x0140    /* FRAM Controller Control 0 */
sfrb(FRCTL0_L , FRCTL0_);
sfrb(FRCTL0_H , FRCTL0_+1);
sfrw(FRCTL0, FRCTL0_);
#define GCCTL0_               0x0144    /* General Control 0 */
sfrb(GCCTL0_L , GCCTL0_);
sfrb(GCCTL0_H , GCCTL0_+1);
sfrw(GCCTL0, GCCTL0_);
#define GCCTL1_               0x0146    /* General Control 1 */
sfrb(GCCTL1_L , GCCTL1_);
sfrb(GCCTL1_H , GCCTL1_+1);
sfrw(GCCTL1, GCCTL1_);

